app/Controllers/Panel/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `citas`
WHERE `estado_cita` = 1
AND `eliminacion` IS NULL
AND `citas`.`eliminacion` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `citas`
WHERE `estado_cita` = 2
AND `eliminacion` IS NULL
AND `citas`.`eliminacion` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `citas`
WHERE `estado_cita` = -1
AND `eliminacion` IS NULL
AND `citas`.`eliminacion` IS NULL
---
    public function obtener_estadisticas_citas()
    {
        $tabla_citas = new Tabla_citas();

        $tabla_citas->resetQuery();
        $pendientes = $tabla_citas->where('estado_cita', 1)->where('eliminacion', null)->countAllResults();

        $tabla_citas->resetQuery();
        $confirmadas = $tabla_citas->where('estado_cita', 2)->where('eliminacion', null)->countAllResults();

        $tabla_citas->resetQuery();
        $canceladas = $tabla_citas->where('estado_cita', -1)->where('eliminacion', null)->countAllResults();