app/Models/Tabla_personas.php

    public function obtener_personas()
    {

        $resultado = $this
            ->select('id_persona , nombre, ap_paterno, ap_materno, codigo_persona ')
            ->orderBy('nombre', 'ASC')
            ->where('id_tipo_persona', 101)
            ->findAll();
---
SELECT `id_persona`, `nombre`, `ap_paterno`, `ap_materno`, `codigo_persona`
FROM `personas`
WHERE `id_tipo_persona` = 101
AND `personas`.`eliminacion` IS NULL
ORDER BY `nombre` ASC