app/Models/Tabla_citas.php

SELECT `citas`.`id_cita`, `citas`.`fecha_cita`, `citas`.`hora_cita`, `citas`.`estado_cita`, `personas`.`nombre`, `personas`.`ap_paterno`, `personas`.`ap_materno`, `servicios`.`nombre_servicio`, `citas`.`eliminacion`
FROM `citas`
JOIN `personas` ON `citas`.`id_persona` = `personas`.`id_persona`
JOIN `servicios` ON `citas`.`id_servicio` = `servicios`.`id_servicio`
ORDER BY `citas`.`fecha_cita` DESC
---
    public function datatable_citas($rol_actual = 0)
    {
        if ($rol_actual == ROL_SUPERADMIN['clave']) {
            $resultado = $this
                ->select('citas.id_cita, citas.fecha_cita, citas.hora_cita, citas.estado_cita, personas.nombre, personas.ap_paterno,
                personas.ap_materno, servicios.nombre_servicio, citas.eliminacion')
                ->join('personas', 'citas.id_persona = personas.id_persona')
                ->join('servicios', 'citas.id_servicio = servicios.id_servicio')
                ->orderBy('citas.fecha_cita', 'DESC')
                ->withDeleted()
                ->findAll();