app/Models/Tabla_categorias.php

SELECT `id_categoria`, `nombre_categoria`, `descripcion_categoria`, `estatus_categoria`, `eliminacion`
FROM `categorias`
ORDER BY `nombre_categoria` ASC
---
    public function datatable_categorias($rol_actual = 0)
    {
        if ($rol_actual == ROL_SUPERADMIN['clave']) {
            $resultado = $this
                ->select('id_categoria, nombre_categoria, descripcion_categoria, estatus_categoria, eliminacion')
                ->orderBy('nombre_categoria', 'ASC')
                ->withDeleted()
                ->findAll();