app/Models/Tabla_producto_categoria.php

    public function datatable_producto_categoria()
    {

        $resultado = $this
            ->select('productos.nombre_producto, productos.descripcion_producto, categorias.nombre_categoria, categorias.descripcion_categoria,
            producto_categoria.id_producto,  producto_categoria.id_categoria ')
            ->join('categorias', 'producto_categoria.id_categoria = categorias.id_categoria')
            ->join('productos', 'producto_categoria.id_producto = productos.id_producto')
            ->orderBy('productos.nombre_producto', 'ASC')
            ->findAll();
---
SELECT `productos`.`nombre_producto`, `productos`.`descripcion_producto`, `categorias`.`nombre_categoria`, `categorias`.`descripcion_categoria`, `producto_categoria`.`id_producto`, `producto_categoria`.`id_categoria`
FROM `producto_categoria`
JOIN `categorias` ON `producto_categoria`.`id_categoria` = `categorias`.`id_categoria`
JOIN `productos` ON `producto_categoria`.`id_producto` = `productos`.`id_producto`
ORDER BY `productos`.`nombre_producto` ASC