app/Models/Tabla_productos.php

SELECT `id_producto`, `nombre_producto`, `descripcion_producto`, `estatus_producto`, `cantidad_producto`, `stock_minimo_producto`, `eliminacion`
FROM `productos`
ORDER BY `nombre_producto` ASC
SELECT `id_producto`, `nombre_producto`, `descripcion_producto`, `cantidad_producto`, `stock_minimo_producto`
FROM `productos`
WHERE `id_producto` = '11'
AND `productos`.`eliminacion` IS NULL
 LIMIT 1
---
    public function datatable_productos($rol_actual = 0)
    {
        if ($rol_actual == ROL_SUPERADMIN['clave']) {
            $resultado = $this
                ->select('id_producto, nombre_producto, descripcion_producto, estatus_producto, cantidad_producto, stock_minimo_producto, eliminacion')
                ->orderBy('nombre_producto', 'ASC')
                ->withDeleted()
                ->findAll();
        } //end if el rol actual es superadmin
        else {
            $resultado = $this
            ->select('id_producto, nombre_producto, descripcion_producto, estatus_producto, cantidad_producto, stock_minimo_producto')
            ->orderBy('nombre_producto', 'ASC')
            ->withDeleted()
            ->findAll();