app/Models/Tabla_citas.php

    public function datatable_citas($rol_actual = 0)
    {
        if ($rol_actual == ROL_SUPERADMIN['clave']) {
            $resultado = $this
                ->select('citas.id_cita, citas.fecha_cita, citas.hora_cita, citas.estado_cita, personas.codigo_persona, personas.nombre, personas.ap_paterno,
                personas.ap_materno, servicios.nombre_servicio, citas.eliminacion')
                ->join('personas', 'citas.id_persona = personas.id_persona')
                ->join('servicios', 'citas.id_servicio = servicios.id_servicio')
                ->where('citas.estado_cita', 1)
                ->orderBy('citas.fecha_cita', 'DESC')
                ->withDeleted()
                ->findAll();
---
SELECT `citas`.`id_cita`, `citas`.`fecha_cita`, `citas`.`hora_cita`, `citas`.`estado_cita`, `personas`.`nombre`, `personas`.`ap_paterno`, `personas`.`ap_materno`, `servicios`.`nombre_servicio`, `citas`.`eliminacion`
FROM `citas`
JOIN `personas` ON `citas`.`id_persona` = `personas`.`id_persona`
JOIN `servicios` ON `citas`.`id_servicio` = `servicios`.`id_servicio`
WHERE `citas`.`estado_cita` = 1
AND `citas`.`estado_cita` = -1
ORDER BY `citas`.`fecha_cita` DESC

    public function datatable_citas_confirmadas()
    {

        $resultado = $this
            ->select('citas.id_cita, citas.fecha_cita, citas.hora_cita, citas.estado_cita, personas.codigo_persona, personas.nombre, personas.ap_paterno,
                personas.ap_materno, servicios.nombre_servicio')
            ->join('personas', 'citas.id_persona = personas.id_persona')
            ->join('servicios', 'citas.id_servicio = servicios.id_servicio')
            ->where('citas.estado_cita', 2)
            ->orderBy('citas.fecha_cita', 'DESC')
            ->findAll();
---
SELECT `citas`.`id_cita`, `citas`.`fecha_cita`, `citas`.`hora_cita`, `citas`.`estado_cita`, `personas`.`nombre`, `personas`.`ap_paterno`, `personas`.`ap_materno`, `servicios`.`nombre_servicio`
FROM `citas`
JOIN `personas` ON `citas`.`id_persona` = `personas`.`id_persona`
JOIN `servicios` ON `citas`.`id_servicio` = `servicios`.`id_servicio`
WHERE `citas`.`estado_cita` = 2
AND `citas`.`eliminacion` IS NULL
ORDER BY `citas`.`fecha_cita` DESC