app/Models/Tabla_usuarios.php

    public function login($email = NULL, $password = NULL)
    {
        $resultado = $this
            ->select('estatus_usuario, id_usuario, nombre_usuario, ap_paterno_usuario,
                        ap_materno_usuario, sexo_usuario, email_usuario, imagen_usuario,
                        usuarios.id_rol AS clave_rol, rol AS nombre_rol')
            ->join('roles', 'usuarios.id_rol = roles.id_rol')
            ->where('email_usuario', $email)
            ->where('password_usuario', $password)
            ->first();
---
SELECT `estatus_usuario`, `id_usuario`, `nombre_usuario`, `ap_paterno_usuario`, `ap_materno_usuario`, `sexo_usuario`, `email_usuario`, `imagen_usuario`, `usuarios`.`id_rol` AS `clave_rol`, `rol` AS `nombre_rol`
FROM `usuarios`
JOIN `roles` ON `usuarios`.`id_rol` = `roles`.`id_rol`
WHERE `email_usuario` = 'superadmin@esnaye.com'
AND `password_usuario` = 'e34f92a20532a873cb3184398070b4b82a8fa29cf48572c203dc5f0fa6158231'
AND `usuarios`.`eliminacion` IS NULL
 LIMIT 1

    public function datatable_usuarios($id_usuario_actual = 0, $rol_actual = 0)
    {
        if ($rol_actual == ROL_SUPERADMIN['clave']) {
            $resultado = $this
                ->select('id_usuario, estatus_usuario, nombre_usuario, ap_paterno_usuario, ap_materno_usuario,
                            sexo_usuario, email_usuario, imagen_usuario, rol, usuarios.eliminacion')
                ->join('roles', 'usuarios.id_rol = roles.id_rol')
                ->where('id_usuario !=', $id_usuario_actual)
                ->orderBy('nombre_usuario', 'ASC')
                ->withDeleted()
                ->findAll();
---
SELECT `id_usuario`, `estatus_usuario`, `nombre_usuario`, `ap_paterno_usuario`, `ap_materno_usuario`, `sexo_usuario`, `email_usuario`, `imagen_usuario`, `rol`, `usuarios`.`eliminacion`
FROM `usuarios`
JOIN `roles` ON `usuarios`.`id_rol` = `roles`.`id_rol`
WHERE `id_usuario` != '1'
ORDER BY `nombre_usuario` ASC