app/Models/Tabla_servicios.php

    public function datatable_servicios($rol_actual = 0)
    {
        if ($rol_actual == ROL_SUPERADMIN['clave']) {
            $resultado = $this
                ->select('id_servicio, nombre_servicio, descripcion_servicio, precio_servicio, estatus_servicio, eliminacion')
                ->orderBy('nombre_servicio', 'ASC')
                ->withDeleted()
                ->findAll();
---
SELECT `id_servicio`, `nombre_servicio`, `descripcion_servicio`, `precio_servicio`, `estatus_servicio`, `eliminacion`
FROM `servicios`
ORDER BY `nombre_servicio` ASC