app/Models/Tabla_usuarios.php

    public function login($email = NULL, $password = NULL)
    {
        $resultado = $this
            ->select('usuarios.estatus_usuario, usuarios.id_usuario, personas.nombre, personas.ap_paterno,
        personas.ap_materno, personas.sexo, personas.correo, personas.imagen,
        usuario_roles.id_rol AS clave_rol, roles.nombre_rol')
            ->join('personas', 'usuarios.id_persona = personas.id_persona')
            ->join('usuario_roles', 'usuarios.id_usuario = usuario_roles.id_usuario')
            ->join('roles', 'usuario_roles.id_rol = roles.id_rol')
            ->where('personas.correo', $email)
            ->where('usuarios.contrasena', $password) // Ya encriptada antes de enviarla
            ->first();
---
SELECT `usuarios`.`estatus_usuario`, `usuarios`.`id_usuario`, `personas`.`id_persona`, `personas`.`nombre`, `personas`.`ap_paterno`, `personas`.`ap_materno`, `personas`.`sexo`, `personas`.`correo`, `personas`.`imagen`, `usuario_roles`.`id_rol` AS `clave_rol`, `roles`.`nombre_rol`
FROM `usuarios`
JOIN `personas` ON `usuarios`.`id_persona` = `personas`.`id_persona`
JOIN `usuario_roles` ON `usuarios`.`id_usuario` = `usuario_roles`.`id_usuario`
JOIN `roles` ON `usuario_roles`.`id_rol` = `roles`.`id_rol`
WHERE `personas`.`correo` = 'trabajador@esnaye.com'
AND `usuarios`.`contrasena` = '46689a646e95da8dc3606f37695fcf57bb5843a4c29bc181bb40a507cdb18bd7'
 LIMIT 1

    public function datatable_usuarios($id_usuario_actual = 0, $rol_actual = 0)
    {
        if ($rol_actual == ROL_SUPERADMIN['clave']) {
            $resultado = $this
                ->select('usuarios.estatus_usuario, personas.codigo_persona, usuarios.id_usuario, personas.nombre, personas.ap_paterno,
        personas.ap_materno, personas.sexo, personas.correo, personas.imagen, roles.nombre_rol, personas.eliminacion, usuarios.id_persona')
                ->join('personas', 'usuarios.id_persona = personas.id_persona')
                ->join('usuario_roles', 'usuarios.id_usuario = usuario_roles.id_usuario')
                ->join('roles', 'usuario_roles.id_rol = roles.id_rol')
                ->where('usuarios.id_usuario !=', $id_usuario_actual)
                ->orderBy('personas.nombre', 'ASC')
                ->withDeleted()
                ->findAll();
---
SELECT `usuarios`.`estatus_usuario`, `personas`.`codigo_persona`, `usuarios`.`id_usuario`, `personas`.`nombre`, `personas`.`ap_paterno`, `personas`.`ap_materno`, `personas`.`sexo`, `personas`.`correo`, `personas`.`imagen`, `roles`.`nombre_rol`, `personas`.`eliminacion`, `usuarios`.`id_persona`
FROM `usuarios`
JOIN `personas` ON `usuarios`.`id_persona` = `personas`.`id_persona`
JOIN `usuario_roles` ON `usuarios`.`id_usuario` = `usuario_roles`.`id_usuario`
JOIN `roles` ON `usuario_roles`.`id_rol` = `roles`.`id_rol`
WHERE `usuarios`.`id_usuario` != '1'
ORDER BY `personas`.`nombre` ASC

    public function obtener_usuario($id_usuario = 0)
    {
        $resultado = $this
            ->select('usuarios.id_usuario, personas.id_persona, personas.nombre, personas.ap_paterno, personas.ap_materno,
                            personas.sexo, personas.correo, personas.imagen, usuario_roles.id_rol')
            ->join('personas', 'usuarios.id_persona = personas.id_persona')
            ->join('usuario_roles', 'usuarios.id_usuario = usuario_roles.id_usuario')
            ->where('usuarios.id_usuario', $id_usuario)
            ->first();
---
SELECT `usuarios`.`id_usuario`, `personas`.`id_persona`, `personas`.`nombre`, `personas`.`ap_paterno`, `personas`.`ap_materno`, `personas`.`sexo`, `personas`.`correo`, `personas`.`imagen`, `usuario_roles`.`id_rol`
FROM `usuarios`
JOIN `personas` ON `usuarios`.`id_persona` = `personas`.`id_persona`
JOIN `usuario_roles` ON `usuarios`.`id_usuario` = `usuario_roles`.`id_usuario`
WHERE `usuarios`.`id_usuario` = '4'
 LIMIT 1